![](https://images.velog.io/images/finelinefe/post/c7b9d8a6-be45-470e-930c-9c99fecb1a4c/agile.png)


##애자일이란? (feat. The Agile Manifesto)
공정과 도구보다 개인과 상호작용을,
포괄적인 문서보다 작동하는 소프트웨어를,
계약협상보다 고객과의 협력을,
계획을 따르기보다 변화에 대응하기를
<br />

적응적 방법론. 역할 보다는 사람, 자기 적응적 개발 프로세스에 초점을 맞춘다.
과거 예단적(기존 공학적)인 방법론은 프로세스나 제품의 예측 가능한 경우에 실시됐다. 개발자와 사용자의 긴밀한 협력이 자주 이루어지고, 다수 생명주기를 여러개로 나눈다.

## 애자일 방법론이 사용되는 경우
1) 큰 규모 프로젝트 < 작은 규모 프로젝트
2) 목표가 자주 바뀌며 유동적인 상황일 때(전통적 방식에서의 변화와 유동성은 적고 안정적이다)
3) 불확실성, 빠른 변화가 요구되며 이에 대해 적극적인 조직문화일 때

즉, 애자일이란 일정한 계획과 기존 관습에 따른 과거 방법론과 다르게 신속하고 유연하게 제품을 개발하며 개선까지 동시에 해나가는 방법론이다. 계획부터 완성까지 완벽하게 수립 후 시행하는 것이 아니라 실행하면서 동시에 수정과 보완을 반복하는 방법론이다.

